docs(api): update architecture doc
